notes.tex
% Created 2018-11-13 Tue 10:16
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[left=2cm, right=2cm, bottom=2cm, top=2cm]{geometry}
\usepackage{parskip}
\def\R{\mathbb{R}}
\def\C{\mathbb{C}}
\def\N{\mathbb{N}}
\def\Z{\mathbb{Z}}
\def\Q{\mathbb{Q}}
\def\pos{\operatorname{pos}}
\def\conv{\operatorname{Conv}}
\usepackage[T1]{fontenc}
\author{Harikrishnan Mulackal}
\date{\today}
\title{Functional Analysis 1}
\hypersetup{
 pdfauthor={Harikrishnan Mulackal},
 pdftitle={Functional Analysis 1},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.13)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Lecture 2 \textit{<2018-10-17 Wed>}}
\label{sec:org9598a56}

\subsection{Examples of metric spaces}
\label{sec:org90ec58f}

\subsubsection{The set of continuous functions \(C[a, b]\)}
\label{sec:org9bd1187}
With a metric \(d(f, g) = \max\vert f(x) - g(x)\vert\)

\subsubsection{The space \(l^p\) of sequences \(x=(x_1, x_2 \cdots,)\) with \(\Vert x \Vert _p < \infty\).}
\label{sec:orgb0331ff}
The metric is the norm of the difference. 

To prove that this is indeed a metric, we need the Minkowiski inequality.

There was a complicated proof of the Minkowski inequality that was discussed
in the lecture. I think one can prove in a simpler fashion. 

The proof involved showing that \(\alpha \cdot \beta \le \alpha^{p}/p +
    \beta^{q}/q\) (This is the young inequality.)

The next step was to prove the Holder inequality. 

The next step is to use Holder on Minkowski. 

Holder: \url{https://en.wikipedia.org/wiki/H\%C3\%B6lder\%27s\_inequality}

Minkowski: \url{https://en.wikipedia.org/wiki/Minkowski\_inequality}

For \(p=q=2\), we obtain the Cauchy-Schwarz inequality. 

\subsection{Definitions involving metric spaces}
\label{sec:org3efca50}

\subsubsection{Open ball}
\label{sec:org270c649}
\(B(x_0, r)\) is the set of all points \(x\) such that the distance from \(x\) to \(x_0\) is less than \(r\).

\subsubsection{Closed ball}
\label{sec:org7defc7b}
Similar to open ball, except that the distance can be less than or \emph{equal to} \(r\).

\subsubsection{Sphere}
\label{sec:orgcab4fb2}
The set of all points \(x\) such that the distance from \(x_0\) to \(x\) is exactly \(r\).

\subsubsection{Relation}
\label{sec:org4a58fb1}
If we subtract a sphere from the closed ball, we get the open ball.

\subsubsection{Definition of open}
\label{sec:org5f0e5bb}
For every point \(x\), we can find an epsilon ball that is inside the set. 

\subsubsection{Definition of closed}
\label{sec:org2532c78}
Basically the complement of the set is open.

\subsubsection{Remark (\(\varepsilon\) neighbourhood)}
\label{sec:org65f62d1}
An open ball \(B(x_0, \varepsilon)\) of radius \(\varepsilon\) is often called
an \(\varepsilon\) neighbourhood. A neighbourhood of \(X\) is that contains an
\(\varepsilon\) neighbourhood of \(X\)

We will use these definition for separable spaces.

\subsubsection{Interior point}
\label{sec:orgd8518ab}
We call \(x_0\) an interior point if there exist an neighbourhood of \(x_0\)
contained inside the space.

\subsubsection{Continuity}
\label{sec:org5cf8032}
About a function from one metric space to another. It's basically the
standard definition. (the definition in the lecture was an \(\varepsilon\),
\(\delta\) definition.) 

The definition was about continuity at a point \(x\). Then a function is
defined to be continuous if it is continuous at every point \(x\).

\subsubsection{Accumulation point}
\label{sec:org356c3c2}
\(A\) be a subset of \(X\). Then \(x_0 \in X\) (not necessarily in \(A\)) is called
accumulation point of \(A\) if every neighbourhood of \(X_0\) contains at least
one point \(y \in A\), \(y \neq x_0\).

\section{Lecture 3 \textit{<2018-10-23 Tue>}}
\label{sec:org487cc3d}
\footnote{A14 1126 tutorial}
\subsection{More definitions}
\label{sec:orgb7f8f02}
\subsubsection{Closure of a set}
\label{sec:orgacda8cc}
\subsubsection{A dense subset of \(X\)}
\label{sec:orga6bf048}
\subsubsection{Separable}
\label{sec:org1f9636d}
If there is a countable subset that is dense in \(X\). \(X\) is defined to be
separable.

Example:
\begin{enumerate}
\item Real numbers are separable.
\item \(l^p\) for \(1 \le p \le \infty\) is separable.
\item \(l^\infty\) not separable. Proof idea: For any set of indices \(I\subset
       \N\), define \((e_I)_n\) is \(1\) is \(h\in I\) and \(0\) otherwise. For every \(I
       \neq y\), we can compute the distance \(d(e_I, e_J) = 1\). How many such
functions are there? The number of such elements are uncountable. (The
proof of this theorem is similar to how \(\{0, 1\}^\N\) is uncountable.)\footnote{Look up at proofs of this fact}
\end{enumerate}
\subsubsection{Definition of convergence}
\label{sec:org8b43edd}
Definition was about the limit of distance going to 0. Note that the limit
\(X\) must be a point in \(X\) (Why?)
\subsubsection{Definition of bounded set}
\label{sec:orgb942951}
\subsubsection{Definition of boundedness of a sequence}
\label{sec:org51000bd}
\subsubsection{Lemma}
\label{sec:org8faf052}
If \(x_n\) is convergent, then it is bounded the limit is unique.
\subsubsection{Lemma}
\label{sec:orgc6066e5}
If \(x_n\) converges to \(x\) and \(y_n\) converges to \(y\), then \(d(x_n, y_n)\)
converges to \(d(x, y)\).
\subsubsection{About convergence and Cauchy sequences}
\label{sec:org68d7030}
\subsubsection{Completeness}
\label{sec:org5a21fd7}
The idea that if a sequence is Cauchy, then it is convergent.
\subsubsection{Theorem about subsets of complete metric space}
\label{sec:org9f548cb}
\(X\) be a metric space. A subspace \(A\) of \(X\) is complete if and only if \(A\) is closed in \(X\).
\subsubsection{Condition about continuity with respect to convergence}
\label{sec:org84c5a8a}
A map \(T\colon X \rightarrow Y\) is continuous if and only if \(x_n
    \rightarrow x_0 \implies T(x_n) \rightarrow T(x_0)\).
\subsubsection{Definition of isometry between metric spaces}
\label{sec:orgb517dbb}
\subsection{Theorem: \(C[a, b]\) is complete}
\label{sec:org65185c6}
Given a closed interval \([a, b]\), the \(C[a, b]\) is complete. 
\subsubsection{Proof}
\label{sec:org68312ba}
Given a Cauchy sequence in this space. We use the completeness of \(\R\) to
define a function to which the Cauchy sequence will converge to. We need
uniform convergence here.
\subsection{The set of polynomials on a \([a, b]\) is not complete}
\label{sec:orgba1be6e}
\(p_n(x) = \sum_i \left(\frac{x}{2}\right)^i\). 

\section{Lecture 4 \textit{<2018-10-25 Thu>}}
\label{sec:orge500bc4}
\subsection{Clarification}
\label{sec:orgb47ffb4}
Some sources say that an Isometry need not be surjective. 

Let \(T\colon X \rightarrow Y\) be injective and \(d(x, y) = \tilde{d}(Tx, Ty)
   \forall x, y \in X\).

Then \(T\) is called isometry (from \(X\)) into \(Y\). 

A couple of examples of isometry were discussed. 

Also we talked about uniform convergence, and also an example of a sequence
that is not uniformly convergent was also discussed. (The idea is that on a
compact set \footnote{Is compactness needed?}, if a uniformly convergent function converges to a
function is continuous.)

Recall that we have already shown that \(C[0, 1]\) is a complete space, meaning
that if a sequence is Cauchy, then it has a limit in the space. Which means
that the limit must also be continuous. (Kinda similar to how uniform
convergence works.)
\subsection{Normed spaces and Banach spaces}
\label{sec:orgefcd264}
A Banach space is just a complete normed space.
\subsubsection{Norm}
\label{sec:orga7c82d6}
A metric space can be obtained by equipping a vector space with a metric
defined in terms of the union, resulting in the \textbf{normed space}. Complete
normed spaces are called \textbf{Banach space}.

A mapping from one normed space to another is called an \textbf{operator} (\$T\(\colon\)
X \(\rightarrow\) Y). A mapping from a normed space to \(\R\) is called a
\textbf{functional} (\(T\colon X \rightarrow \R\))

It can be shown that a linear operator is continuous if and only if it is
bounded.

The set of all bounded linear operators from a space \(X\) to a space \(Y\) is
again a normed space.

Similarly, the set of all bounded linear functionals is a normed space, the
dual space \(X'\) of \(X\).
\subsubsection{Vector space}
\label{sec:org0aaa25d}
I didn't write this down. But it's pretty clear. 
\subsubsection{Examples}
\label{sec:org8d1e80f}
\begin{enumerate}
\item \(\R^n\)
\item \(C[a, b]\). It's kinda clear how to define a vector space structure on it.
\end{enumerate}
\subsubsection{Subspace}
\label{sec:orgab7ea26}
We defined a subspace of a vector space. 
\subsubsection{Span}
\label{sec:org5fc4de8}
Span was defined.
