notes.tex
\subsection{Example}
\label{sec:org964ebe0}
Given \(A \in \R^{n \times n}\), the linear operator \(T \colon \R^{n}
   \rightarrow \R^{n}\) is bounded since \((\sup_{\Vert x \Vert= 1} \Vert A x
   \Vert)^2 = \sup x^{T} A^{T} A x = \lambda \max(A^T A)\), the largest
eigenvalue of \(A^{T}A\) (Rayleigh-Ritz theorem.)

Note that for \(A = U \sum V^T\), so that \(A^{T} A = V \sigma^2 V^{T}\), thus
\(\lambda_{\max} = \delta_{1}^2\), where \(\delta_1\) is the largest singular
value of \(A\).

Let \(X\) be the space of all polynomials on \([0, 1]\) and \(\Vert f \Vert =
   \max_{x \in [0, 1]} \vert f (x) \vert\). The differentiation operator \(T\) with
\(Tf = f'\) is not bounded. Since for \(f_n(x) = x^n\), \(\Vert f_n\Vert = 1\), all
these functions are bounded above by \(1\), hence the norm is \(1\), whereas, the
norm of the derivative is \(n\) and this is unbounded.

\(T \colon C[0, 1] \rightarrow C[0, 1]\) by \((Tf)(x) = \int_{0}^{x} f(t)\ dt\).
Then \(\Vert T f\Vert = \max_{x \in [0, 1]} \vert \int_{0}^{1} f(t)\ dt\vert
   \le \max_{x \in [0, 1]} \int_{0}^{1} \vert f(t) \vert dt \le (1-0) \max_{x\in
   [0, 1]} \vert f(x) \vert = \Vert f \Vert\), thus \(\Vert T \Vert \le 1\), but we
can choose the function identical to \(1\), then the norm is exactly equal to
\(1\).

Define \(c = \{x_n \in l_1 \vert \exits N \in \N\colon x_n = 0, \forall n >
   N\}\), with the \(l_1\) norm. We define the operator \(T\colon (x_1, x_2, x_3,
   \cdots) = (x_1, 2x_2, 3x_3, \cdots)\) is unbounded, we can compute \(\Vert T
   e_i \Vert = i\), so if we have the sequence but the \(\Vert e_i \Vert = 1\).
\subsection{Theorem}
\label{sec:org3e0da78}
Every linear operator on a finite dimensional normed space is bounded.
\subsubsection{Proof}
\label{sec:orgc31f30b}
Let \(n\) be the dimension of \(X\) and \(\{e_1, \cdots, e_n\}\) a basis.

Any \(x\in X\) can be written as \(X = \sum \alpha_i e_i\), thus \(\Vert Tx \Vert
    = \Vert T \sum \alpha_i e_i\Vert \le \sum \Vert T \alpha_i e_i\Vert = \sum
    \vert \alpha_i \vert \le \max_{i} \Vert T e_i \Vert . \sum \vert \alpha_i
    \vert\). We define \(\Vert x \Vert_0 = \sum \vert \alpha_i \vert\) defines a
norm. Since all norms on finite-dimensional spaces are equivalent, there
exist \(c\) such that \(\Vert x \Vert_0 \le c \Vert x \Vert\). Thus \(\Vert T
    x\Vert \le \max \Vert T e_i \Vert \cdot c \cdot \Vert x \Vert\) and \(T\) is
bounded.
\section{Lecture 7 \textit{<2018-11-08 Thu>}}
\label{sec:org985d2c1}
\subsection{Theorem about Bounded operators}
\label{sec:org357a37f}
For linear operators, continuity and boundedness are equivalent.

Continuity of \(T\) means that \(\forall \varepsilon > 0\), there exists a
\(\delta > 0\), such that \(\Vert x - x_0 \Vert < \delta \implies \vert Tx -
   Tx_0 \vert < \varepsilon\).
\subsubsection{Proof}
\label{sec:org57cdbbc}
There is nothing to show for \(T=0\), now we assume that \(T\) is not the zero
operator, i.e., \(\exists r\) such that \(\Vert T x \Vert \le r \Vert x \Vert\).
Using linearity, we can write that \(\Vert Tx - Tx_0\Vert = \Vert T (x -
    x_0)\Vert \le \delta \Vert x - x_0\Vert\). Choose \(\delta =
    \varepsilon/\delta\), thus \(\Vert x -x_0 \Vert < \delta \implies \Vert Tx -
    Tx_0 \Vert \delta \Vert x - x_0\Vert\le \gamma\cdot \delta =\varepsilon\) and
\(T\) is continuous.

Conversely, assume that \(T\) is continuous. Take arbitrary \(y\in D(T)\),
define \(X = X_0 + \frac{\delta}{\Vert y \Vert} y\). Thus \(\Vert x - x_0 \Vert
    = \Vert \frac{\delta}{\Vert y \Vert} \cdot y \Vert = \delta\). Since \(T\) is
continuous, \(\Vert Tx - Tx_0 \Vert < \varepsilon\). Now \(\Vert Tx - Tx_0\Vert
    = \Vert T \delta/\Vert y \Vert y \Vert = \frac{\delta}{\Vert y \Vert}\Vert T
    y \Vert < \varepsilon\) Multiplying by \(\Vert y \Vert / \delta\), we get
\$\Vert T y \Vert < \(\varepsilon\)/\(\delta \cdot \Vert y \Vert\) We call the last
term \(\gamma\).

The second part of the proof shows that continuity in one point suffices to
show boundedness. And boundedness means continuity at all points. Thus
continuity at one point implies continuity at all points. Pretty interesting!
\subsection{Corollary}
\label{sec:orgb6100f3}
Given a linear bounded operator \(T\), it holds that 
\begin{enumerate}
\item \(x_n \rightarrow x\) implies that \(Tx_n \rightarrow Tx\)
\item The null space of such an operator is closed
\end{enumerate}
\subsubsection{Proof}
\label{sec:org18352b1}
These are basically properties of continuous functions.
\subsection{Definition}
\label{sec:org4a19808}
We write that \(T_1 = T_2\) if \(D(T_1) = D(T_2)\) and \(T_1x = T_2x\) for all \(x
   \in D(T_1) = D(T_2)\). Furthermore \(T\vert_B\) denotes the restriction to the
set \(B\), i.e., \(T\vert_B \colon B \rightarrow Y\) with \(T\vert_B x = Tx\) for
all \(x \in B\).

The extension of \(T\), denoted by \(\tilde{T}\colon M \rightarrow Y\) where \(D(T)
   \subset M\) is defined by \(\tilde{T}x = Tx\), for all \(x\in D(T)\).

Example of extension. The set \(X = Y = \R\), define \(T\) by \(Tx=x\), and \$D(T) =
[0, 1]. Then \(\tilde{T}\) defined by \(\tilde{T}x = \vert x \vert\) with
\(D(\tilde{T}) = [-1, 1]\) is an extension of \(T\)
\subsection{Theorem}
\label{sec:org14c7885}
If \(T \colon D(T) \rightarrow Y\) is a bounded linear operator, \(D(T)\), part
of a normed space, \(Y\), a Banach space, then there is an extension
\(\tilde{T}\colon \bar{D(T)} \rightarrow Y\) with \(\Vert \tilde{T} \Vert =
   \Vert T \Vert\). Furthermore, \(\tilde{T}\) is a bounded linear operator.
\subsubsection{Proof}
\label{sec:org634dfdc}
For any \(x \in \bar{D}(T)\) consider the sequence \((x_n)_n\) in \(D(T)\) that
converges to \(x\).

\(\Vert Tx_n - Tx_m \Vert = \Vert T(x_n - x_m)\Vert \le \Vert T \Vert \Vert
    x_n - x_m\Vert\). Since \(x_m\) converges, \(Tx_n\) is Cauchy and converges as we
assumed \(Y\) to be complete. The rest of the argument is trivial.
\subsection{Linear functionals}
\label{sec:org917507d}
A functional is a map from \(X\) to \(\R\) or \(\C\). Given a functional \(f\),
\(D(f)\) denotes the domain, \(R(f)\) denotes the range of \(f\). 

For functionals, we typically write \(f(x)\) and not \(fx\), although \(f\) is
still an operator.
\subsubsection{Example}
\label{sec:org1d8d307}
\begin{enumerate}
\item For a normed space \(X\), \(\Vert . \Vert \colon X \rightarrow \R\) is a functional.
\item For \(X=\R\), and \(x_0 in X\), \(f\colon X\rightarrow \R\), \(x\mapsto x_0^{T}x
       = \langle x_0, x\rangle\).
\item Linearity is defined as before, with the difference that \(y\) is now \(\R\)
if \(X\) is a real or \(\C\), if \(X\) is a complex space.
\end{enumerate}
\subsubsection{Example}
\label{sec:orgec6184d}
\begin{enumerate}
\item The norm functional is not a linear functional. \(\Vert \alpha x + \beta y
       \Vert \neq \alpha \Vert x \Vert + \beta \Vert y \Vert\). This is not true
in general.
\item Define \(f(x) = x_0^{T}x\) is linear, clearly, because the scalar product
is bilinear. It is linear in each variable.
\item The evaluation functional given by the Dirac delta function \(\delta_x f =
       f(x)\).
\item The definite integral is a functional. Let \(l\) denote the functional such
that for \(f\) in \(C[a, b]\), \(l(f) = \int_{a}^{b} f(x) dx\), then it is
straightforward to verify that this is linear.
\end{enumerate}
\subsubsection{Remark}
\label{sec:org19b197a}
Similarly, boundedness is again defined as: A linear functional is bounded
if there exists a constant \(c\) such that \(\vert f(x) \vert \le c \cdot \Vert
    x \Vert\). and \(\Vert v \Vert = \sup \vert f(x) \vert / \Vert x \Vert =
    \sup_{\Vert x \Vert = 1} \vert f(x) \vert\).
\subsubsection{Theorem}
\label{sec:org8b9ad1d}
Let \(f\colon D(f) \rightarrow K\) be a linear functional, then \(f\) is
continuous if and only if it is bounded.
\subsubsection{Example}
\label{sec:org78ed98d}
\begin{enumerate}
\item For integrable functions on \([a, b]\), it is easy to see that the integral
functional is bounded.
\item The dot product example can be extended to \(l_2\) by choosing a fixed
element \(a\) in \(l_2\) and setting \(f(x) = \sum a_i x_i\). Due to
Cauchy-Schwarz inequality \(\vert \langle x, y\rangle\vert \le \Vert x
       \Vert \cdot \Vert y \Vert\).
\end{enumerate}
\end{document}